Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>АПК:93 одинаковое представление и для объекта и для списка</Comment>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.ОприходованиеЗапасов</xr:Item>
				<xr:Item>Document.СборкаЗапасов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьНовыеЦеныПоверхУстановленных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьДействующуюЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЗависимыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНедействительныеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьОтклонениеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьХарактеристикамБезЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНовуюЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНаценку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетИзВидаЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйНовыйФормат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаСтарая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры/Forms/ФормаПроизвольногоПодбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("АктивныеЗадания", Новый Массив);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"Характеристика", "Видимость", ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики"));
	
	Если Параметры.Свойство("ПоказыватьНедействительныеХарактеристики") Тогда
		ПоказыватьНедействительныеХарактеристики = Параметры.ПоказыватьНедействительныеХарактеристики;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнициализироватьСхемуКомпоновкиПриОткрытии();
	ЗагрузитьНастройкиФормы();
	ИнициализироватьКомпоновщикНастроекНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		
		СохраняемыеНастройки = Новый Структура;
		СохраняемыеНастройки.Вставить("ТекущаяСхемаКомпоновки", ТекущаяСхемаКомпоновки);
		
		КлючНастроек = "ТекущаяСхемаКомпоновкиФормыПодбораПоОтбору";
		СохранитьНастройкиФормы(СохраняемыеНастройки, КлючНастроек);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТекущаяСхемаКомпоновкиПриИзменении(Элемент)
	
	ОбработатьВыборСхемыКомпоновкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастроекНастройкиОтбор

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	
	ОбновитьКорзину();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастроекНастройкиПараметрыДанных

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиПараметрыДанныхПриИзменении(Элемент)
	
	ОбновитьКорзину();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	АдресВременногоХранилища = Новый УникальныйИдентификатор;
	Закрыть(Новый Структура("ВыборПроизведен, АдресВременногоХранилища", Истина, ПоместитьКорзинуВоВременноеХранилище(АдресВременногоХранилища)));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьВыборСхемыКомпоновкиНаСервере()
	
	ИнициализироватьКомпоновщикНастроекНаФорме();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроекНаФорме()
	
	Если НЕ КэшЗначений.АдресаСхемКомпоновки.Свойство(ЭтотОбъект.ТекущаяСхемаКомпоновки) Тогда
		ЭтотОбъект.ТекущаяСхемаКомпоновки = "ПодборСКД_Остатки";
	КонецЕсли;
	
	СхемаКомпоновки = ПолучитьИзВременногоХранилища(КэшЗначений.АдресаСхемКомпоновки[ЭтотОбъект.ТекущаяСхемаКомпоновки]);
	АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновки);
	
	КомпоновщикНастроек.Инициализировать(Источник);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	ЕстьДоступныеНастройки = Ложь;
	Для каждого Параметр Из СхемаКомпоновки.Параметры Цикл
		Если НЕ Параметр.ОграничениеИспользования Тогда
			ЕстьДоступныеНастройки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаНастройки", "Видимость", ЕстьДоступныеНастройки);
	КэшЗначений.Вставить("ЕстьДоступныеНастройки", ЕстьДоступныеНастройки);

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	СхемаКомпоновки = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновки);
	
	Если СхемаКомпоновки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();
	
	СформироватьСтруктуруВыводаНастроекКомпоновки(НастройкиКомпоновщика);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки, 
		НастройкиКомпоновщика, , ,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	
	ИзменитьРеквизитыИДобавитьЭлементыКорзиныПоПолямСтруктуры();
	
	Корзина.Очистить();
	Таблица = РеквизитФормыВЗначение("Корзина");
	
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьОбъект(Таблица);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);
	
	МассивКолонок = Новый Массив;
	Для каждого Колонка Из Таблица.Колонки Цикл
		МассивКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	Таблица.Свернуть(СтрСоединить(МассивКолонок, ","));
	
	ЗначениеВРеквизитФормы(Таблица, "Корзина");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруВыводаНастроекКомпоновки(НастройкиКомпоновщика)
	
	ОбязательныеПоляСтруктуры = Новый Массив;
	ОбязательныеПоляСтруктуры.Добавить("Номенклатура");
	ОбязательныеПоляСтруктуры.Добавить("Характеристика");
	
	ГруппировкаДетали = НастройкиКомпоновщика.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаДетали.Использование = Истина;
	
	ДополнительныеПоляСтруктуры = Новый Соответствие;
	ЗаполнитьПоляПоДеревуОтбора(НастройкиКомпоновщика.Отбор, ГруппировкаДетали.Отбор, НастройкиКомпоновщика.ДоступныеПоляОтбора, 
		ДополнительныеПоляСтруктуры, ОбязательныеПоляСтруктуры);
	
	Для каждого Поле Из ОбязательныеПоляСтруктуры Цикл
		ПолеГруппировки = ГруппировкаДетали.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЦикла;
	
	Для каждого Поле Из ДополнительныеПоляСтруктуры Цикл
		ПолеГруппировки = ГруппировкаДетали.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Поле.Значение.Путь);
		ПолеГруппировки.Заголовок = Поле.Значение.Заголовок;
	КонецЦикла;
	
	КэшЗначений.Вставить("ОбязательныеПоляКорзины", ОбязательныеПоляСтруктуры);
	КэшЗначений.Вставить("ДополнительныеПоляКорзины", ДополнительныеПоляСтруктуры);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРеквизитыИДобавитьЭлементыКорзиныПоПолямСтруктуры()
	
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	УдаляемыеЭлементы = Новый Массив;
	ОбязательныеПоляКорзины = КэшЗначений.ОбязательныеПоляКорзины;
	ДополнительныеПоляКорзины = КэшЗначений.ДополнительныеПоляКорзины;
	
	Для каждого Поле Из Элементы.Корзина.ПодчиненныеЭлементы Цикл
		Если ОбязательныеПоляКорзины.Найти(Поле.Имя) = Неопределено Тогда
			УдаляемыеРеквизиты.Добавить(Поле.ПутьКДанным);
			УдаляемыеЭлементы.Добавить(Поле);
		КонецЕсли;
	КонецЦикла;
	
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
	МаксимальныйИндекс = УдаляемыеЭлементы.Количество() - 1;
	Пока МаксимальныйИндекс >= 0 Цикл
		Элементы.Удалить(УдаляемыеЭлементы.Получить(МаксимальныйИндекс));
		МаксимальныйИндекс = МаксимальныйИндекс - 1;
	КонецЦикла;
	
	Для Каждого Поле Из ДополнительныеПоляКорзины Цикл  
		
		КлючСтруктуры = ПодготовитьКлючСтруктуры(Поле.Ключ);
		
		НовыйРеквизит = Новый РеквизитФормы(КлючСтруктуры, Поле.Значение.Тип, "Корзина");
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого Поле Из ДополнительныеПоляКорзины Цикл 
		
		КлючСтруктуры = ПодготовитьКлючСтруктуры(Поле.Ключ);
		
		Элемент = Элементы.Добавить(КлючСтруктуры, Тип("ПолеФормы"), Элементы.Корзина);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Корзина." + КлючСтруктуры;
		Элемент.ТолькоПросмотр = Истина;
		Элемент.Заголовок = Поле.Значение.Заголовок;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодготовитьКлючСтруктуры(ЗначениеКлюча)
	
	Результат = СтрЗаменить(ЗначениеКлюча, ",", "_");
	Результат = СтрЗаменить(Результат, """", "_");
	Результат = СтрЗаменить(Результат, "'", "_");   
	Результат = СтрЗаменить(Результат, ">", "");
	Результат = СтрЗаменить(Результат, "<", "");  
	Результат = СтрЗаменить(Результат, ")", "");
	Результат = СтрЗаменить(Результат, "(", "");
	Результат = СтрЗаменить(Результат, ".", "");
	Результат = СтрЗаменить(Результат, "-", ""); 
	Результат = СтрЗаменить(Результат, "{", "");
	Результат = СтрЗаменить(Результат, "}", "");
	Результат = СтрЗаменить(Результат, "[", "");
	Результат = СтрЗаменить(Результат, "]", ""); 
	Результат = СтрЗаменить(Результат, "_", "");
	Результат = СтрЗаменить(Результат, " ", "");
	Результат = СтрЗаменить(Результат, Символы.НПП, "");
	Результат = СтрЗаменить(Результат, Символы.ПС, "");
	
	Возврат ВРег(Результат); 
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПоляПоДеревуОтбора(Отбор, ГруппировкаДеталиОтбор, ДоступныеПоляОтбора, ДополнительныеПоляСтруктуры, ОбязательныеПоляСтруктуры)
	
	Для каждого ЭлементОтбора Из Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда

			Если ЭлементОтбора.Использование Тогда
					
				ОтборГруппировки = ГруппировкаДеталиОтбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(ОтборГруппировки, ЭлементОтбора);
				ЗаполнитьПоляПоДеревуОтбора(ЭлементОтбора, ОтборГруппировки, ДоступныеПоляОтбора, 
					ДополнительныеПоляСтруктуры, ОбязательныеПоляСтруктуры);
					
			КонецЕсли;
				
		Иначе
			Если ЭлементОтбора.Использование Тогда
				
				ОтборГруппировки = ГруппировкаДеталиОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(ОтборГруппировки, ЭлементОтбора);
				ЭлементОтбора.Использование = Ложь;
				
				Поле = Строка(ЭлементОтбора.ЛевоеЗначение);
				ДоступноеПоле = ДоступныеПоляОтбора.Элементы.Найти(Поле);
				Если ОбязательныеПоляСтруктуры.Найти(Поле) = Неопределено Тогда
					
					Если ДоступноеПоле <> Неопределено Тогда
						Заголовок = ДоступноеПоле.Заголовок;
						Тип = ДоступноеПоле.ТипЗначения;
					Иначе
						Заголовок = Поле;
						Тип = Новый ОписаниеТипов("Строка");
					КонецЕсли;
					СтруктураПоля = Новый Структура;
					СтруктураПоля.Вставить("Заголовок", Заголовок);
					СтруктураПоля.Вставить("Тип", Тип);
					СтруктураПоля.Вставить("Путь", Строка(ЭлементОтбора.ЛевоеЗначение));
					КлючПоля = СтрЗаменить(Поле, ".", "");
					КлючПоля = СтрЗаменить(КлючПоля, "[", "_");
					КлючПоля = СтрЗаменить(КлючПоля, "]", "_");
					КлючПоля = СтрЗаменить(КлючПоля, "(", "_");
					КлючПоля = СтрЗаменить(КлючПоля, ")", "_");
					КлючПоля = СтрЗаменить(КлючПоля, " ", "");

					ДополнительныеПоляСтруктуры.Вставить(КлючПоля, СтруктураПоля);
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДоступныхСхемКомпоновки()
	
	МакетыПодборов = Новый Соответствие;
	МакетыДокумента = Метаданные.Документы.УстановкаЦенНоменклатуры.Макеты;
	Для каждого МакетДокумента Из МакетыДокумента Цикл
		Если СтрНайти(МакетДокумента.Имя, "ПодборСКД_") <> 0 Тогда
			
			МакетыПодборов.Вставить(МакетДокумента.Имя, МакетДокумента.Синоним);
			
		КонецЕсли;
	КонецЦикла;
	Возврат МакетыПодборов;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьСхемуКомпоновкиПриОткрытии()
	
	СписокДоступныхСхем = ПолучитьСписокДоступныхСхемКомпоновки();
	АдресаСхемКомпоновки = Новый Структура;

	Для каждого ДоступнаяСхема Из СписокДоступныхСхем Цикл
		
		Элементы.ТекущаяСхемаКомпоновки.СписокВыбора.Добавить(ДоступнаяСхема.Ключ, ДоступнаяСхема.Значение);
		
		СхемаКомпоновки = Документы.УстановкаЦенНоменклатуры.ПолучитьМакет(ДоступнаяСхема.Ключ);
		АдресаСхемКомпоновки.Вставить(ДоступнаяСхема.Ключ, ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор));
		
	КонецЦикла;

	Если СписокДоступныхСхем.Количество() = 1 Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ТекущаяСхемаКомпоновки", "Видимость", Ложь);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ТекущаяСхемаКомпоновки", "Видимость", Истина);
		
	КонецЕсли;
	
	КэшЗначений.Вставить("АдресаСхемКомпоновки", АдресаСхемКомпоновки);
	
КонецПроцедуры

// Сохраняет настройки формы по имени формы
//
// Параметры:
// 	- СохраняемыеНастройки - Структура сохраняемых настроек
//
&НаСервереБезКонтекста
Процедура СохранитьНастройкиФормы(СохраняемыеНастройки, КлючНастроек)

	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(
		"Документ.УстановкаЦенНоменклатуры.ФормаПроизвольногоПодбора",
		КлючНастроек, СохраняемыеНастройки);
	
КонецПроцедуры

// Получает настройки формы и загружает их в реквизиты
// Если настройки не были сохранены ранее, то будут загружены настройки по умолчанию
// из процедуры ПолучитьНастройкиФормыПоУмолчанию()
//
&НаКлиенте
Процедура ЗагрузитьНастройкиФормы()
	
	ЗагружаемыеНастройкиПоУмолчанию = ПолучитьНастройкиФормыПоУмолчанию();
	КлючНастроек 					= "ТекущаяСхемаКомпоновкиФормыПодбораПоОтбору";
	ЗагружаемыеНастройки 			= ПолучитьНастройкиФормы(ЗагружаемыеНастройкиПоУмолчанию, КлючНастроек);
	
	ЭтотОбъект.ТекущаяСхемаКомпоновки = ЗагружаемыеНастройки.ТекущаяСхемаКомпоновки;
	
КонецПроцедуры

// Возвращает настройки формы по умолчанию
// 
// Возвращаемое значение:
// - Структура настроек формы
//
&НаКлиенте
Функция ПолучитьНастройкиФормыПоУмолчанию()
	
	ЗагружаемыеНастройкиПоУмолчанию = Новый Структура;
	ЗагружаемыеНастройкиПоУмолчанию.Вставить("ТекущаяСхемаКомпоновки", "ПодборСКД_Остатки");
	Возврат ЗагружаемыеНастройкиПоУмолчанию;
	
КонецФункции

// Возвращает сохраненные настройки формы или настройки по умолчанию
//
// Параметры:
//  - ЗагружаемыеНастройки - структура настроек по умолчанию
// 
// Возвращаемое значение:
// - Структура настроек формы, если они были сохранены ранее, либо структура настроек по умолчанию
//
&НаСервереБезКонтекста
Функция ПолучитьНастройкиФормы(ЗагружаемыеНастройки, КлючНастроек)
		
	Возврат ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(
		"Документ.УстановкаЦенНоменклатуры.ФормаПроизвольногоПодбора",
		КлючНастроек, ЗагружаемыеНастройки);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьКорзину()
	
	ИмяОбновляемогоСвойства = "Видимость";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаИнформация", 
			ИмяОбновляемогоСвойства, Ложь);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Корзина", 
			ИмяОбновляемогоСвойства, Ложь);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОжидание", 
			ИмяОбновляемогоСвойства, Истина);
	
	ПодключитьОбработчикОжидания("ИзменениеПараметровОтборовКомпоновщика", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаданиеОбновленияКорзины()
	
	РезультатНачалаЗаполненияКорзины = НачатьЗаполнениеКорзины();
	ДлительнаяОперация = РезультатНачалаЗаполненияКорзины.ДлительнаяОперация;
	ИдентификаторЗаданияЗаполнения = ДлительнаяОперация.ИдентификаторЗадания;
	
	ДополнительныеПараметрыРезультата = Новый Структура("ИдентификаторЗаданияЗаполнения, АдресНастроекКомпоновщика", 
		ИдентификаторЗаданияЗаполнения, РезультатНачалаЗаполненияКорзины.АдресНастроекКомпоновщика);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьЗаполнениеКорзины", ЭтотОбъект, ДополнительныеПараметрыРезультата);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнениеКорзины()
	
	Для каждого ИдентификаторЗадания Из КэшЗначений.АктивныеЗадания Цикл
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	КонецЦикла;
	КэшЗначений.АктивныеЗадания = Новый Массив;

	НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();
	
	СхемаКомпоновки = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновки);
	
	СформироватьСтруктуруВыводаНастроекКомпоновки(НастройкиКомпоновщика);
	
	Таблица = РеквизитФормыВЗначение("Корзина");
	
	Если Таблица.Колонки.Количество() > 2 Тогда  
		
		// очистим все необязательные колонки таблицы
		ИндексТекущейКолонки = Таблица.Колонки.Количество() - 1;
		ИндексПоследнейКолонки = ИндексТекущейКолонки;  
		
		Пока ИндексТекущейКолонки <> 0 Цикл 
				
			ТекущаяКолонка = Таблица.Колонки[ИндексТекущейКолонки];
			
			Если ТекущаяКолонка.Имя <> "Номенклатура" 
				И ТекущаяКолонка.Имя <> "Характеристика" Тогда 
				
				Таблица.Колонки.Удалить(ТекущаяКолонка);  
				
			КонецЕсли;
		
			ИндексТекущейКолонки = ИндексТекущейКолонки - 1; 
			
		КонецЦикла; 
		
	КонецЕсли;
	
 	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("СхемаКомпоновки", СхемаКомпоновки);
	ПараметрыПроцедуры.Вставить("НастройкиКомпоновщика", НастройкиКомпоновщика);
	ПараметрыПроцедуры.Вставить("Корзина", Таблица);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"Документы.УстановкаЦенНоменклатуры.ЗаполнитьКорзинуФормыПроизвольногоПодбора", ПараметрыПроцедуры);
	
	КэшЗначений.АктивныеЗадания.Добавить(ДлительнаяОперация.ИдентификаторЗадания);
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("АдресНастроекКомпоновщика", 
		ПоместитьВоВременноеХранилище(НастройкиКомпоновщика, УникальныйИдентификатор));
	СтруктураРезультата.Вставить("ДлительнаяОперация", ДлительнаяОперация);
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьЗаполнениеКорзины(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено 
		И ЭтоАдресВременногоХранилища(Результат.АдресРезультата) 
		И Результат.Статус = "Выполнено" 
		И ДополнительныеПараметры.ИдентификаторЗаданияЗаполнения = ИдентификаторЗаданияЗаполнения Тогда
		
		ОбработатьЗаполнениеКорзиныНаСервере(Результат, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаполнениеКорзиныНаСервере(Результат, ДополнительныеПараметры)
	
	НастройкиКомпоновщика = ПолучитьИзВременногоХранилища(ДополнительныеПараметры.АдресНастроекКомпоновщика);
	
	ИзменитьРеквизитыИДобавитьЭлементыКорзиныПоПолямСтруктуры();
	
	ТаблицаРезультат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);   		
	Если ТаблицаРезультат <> Неопределено Тогда
			
		ПривестиНазванияКолонокТаблицыКФорматуКорзины(ТаблицаРезультат);
		
		Если ТаблицаРезультат.Колонки.Количество() = Корзина.Выгрузить().Колонки.Количество() Тогда
			
			ЗначениеВРеквизитФормы(ТаблицаРезультат, "Корзина"); 
		
		Иначе
		
			ЗаполнитьКорзинуПоОбязательнымКолонкам(ТаблицаРезультат); 
		
		КонецЕсли;
		
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Корзина", 
			"Видимость", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОжидание", 
			"Видимость", Ложь);
		
КонецПроцедуры   

&НаСервереБезКонтекста
Процедура ПривестиНазванияКолонокТаблицыКФорматуКорзины(ТаблицаРезультат)
	
	ИндексТекущейКолонки = ТаблицаРезультат.Колонки.Количество() - 1;
	ИндексПоследнейКолонки = ИндексТекущейКолонки;  
		
	Пока ИндексТекущейКолонки <> 0 Цикл 
		
		
		ТекущаяКолонка = ТаблицаРезультат.Колонки[ИндексТекущейКолонки];
		
		// Номенклатура и Характеристика обязательные колонки, их названия не меняем.
		Если ПропуститьОбязательныеКолонки(ТекущаяКолонка.Имя) Тогда
			
			НовоеИмяКолонки = ПодготовитьКлючСтруктуры(ТекущаяКолонка.Имя); 
			ТекущаяКолонка.Имя = НовоеИмяКолонки; 
			
		КонецЕсли;
		
		ИндексТекущейКолонки = ИндексТекущейКолонки - 1; 
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьКорзинуПоОбязательнымКолонкам(ТаблицаРезультат)
	
	Если ТаблицаРезультат <> Неопределено Тогда 
		
		Корзина.Очистить();
		Для Каждого СтрокаТаблицаИсточник Из ТаблицаРезультат Цикл 
			СтрокаТаблицаКорзина = Корзина.Добавить(); 
			ЗаполнитьЗначенияСвойств(СтрокаТаблицаКорзина, СтрокаТаблицаИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПропуститьОбязательныеКолонки(ИмяКолонки)
	
	Результат = Ложь; 
	
	Если ИмяКолонки <> "Номенклатура" И ИмяКолонки <> "Характеристика" Тогда 
		Результат = Истина;	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИзменениеПараметровОтборовКомпоновщика()
	
	ОтключитьОбработчикОжидания("ИзменениеПараметровОтборовКомпоновщика");
	ВыполнитьЗаданиеОбновленияКорзины();
	
КонецПроцедуры

&НаСервере
Функция ПоместитьКорзинуВоВременноеХранилище(АдресВременногоХранилища)
	
	Таблица = РеквизитФормыВЗначение("Корзина");
	Возврат Документы.УстановкаЦенНоменклатуры.ПолучитьНоменклатуруИзПроизвольнойФормы(Таблица,
		ПоказыватьНедействительныеХарактеристики, АдресВременногоХранилища);
	
КонецФункции
	
#КонецОбласти
